-- MySQL dump 10.13  Distrib 8.0.34, for macos13 (arm64)
--
-- Host: localhost    Database: andropedia_db
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `lesson`
--

DROP TABLE IF EXISTS `lesson`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `lesson` (
  `id` int NOT NULL AUTO_INCREMENT,
  `levelName` text NOT NULL,
  `lastUpdateDate` date NOT NULL,
  `levelNumber` int NOT NULL,
  `courseNumber` int NOT NULL,
  `themeNumber` int NOT NULL,
  `uniqueLevelId` int NOT NULL,
  `uniqueThemeId` int NOT NULL,
  `language` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=134 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lesson`
--

LOCK TABLES `lesson` WRITE;
/*!40000 ALTER TABLE `lesson` DISABLE KEYS */;
INSERT INTO `lesson` VALUES (1,'Знакомство с andropedia','2023-10-31',1,1,1,20,3,'rus'),(2,'Почему kotlin','2023-10-31',2,1,1,21,3,'rus'),(3,'Android Studio','2023-10-31',3,1,1,22,3,'rus'),(4,'Эмулятор','2023-10-31',4,1,1,23,3,'rus'),(5,'Manifest','2023-10-31',5,1,2,24,4,'rus'),(6,'Gradle Script','2023-10-31',6,1,2,25,4,'rus'),(7,'Создание layout','2023-10-31',7,1,2,26,4,'rus'),(8,'Мотивация','2023-10-31',8,1,2,27,4,'rus'),(9,'Классы','2023-10-31',9,1,3,28,5,'rus'),(10,'Констатнты','2023-10-31',10,1,3,29,5,'rus'),(11,'Локализация','2023-10-31',11,1,3,30,5,'rus'),(12,'Модификаторы доступа','2023-10-31',12,1,3,31,5,'rus'),(13,'Переменные','2023-10-31',13,1,3,32,5,'rus'),(14,'Различные операции с переменными','2023-10-31',14,1,3,33,5,'rus'),(15,'Типы данных','2023-10-31',15,1,3,34,5,'rus'),(16,'Функции','2023-10-31',16,1,3,35,5,'rus'),(17,'Lateinit','2023-10-31',17,1,3,36,5,'rus'),(18,'Безопасные вызовы и оператор elvis','2023-10-31',18,1,4,37,6,'rus'),(19,'Оператор when','2023-10-31',19,1,4,38,6,'rus'),(20,'Операторы сравнения и взаимодействия операторов','2023-10-31',20,1,4,39,6,'rus'),(21,'Тернарный оператор','2023-10-31',21,1,4,40,6,'rus'),(22,'Условные выражения','2023-10-31',22,1,4,41,6,'rus'),(23,'Deprecated','2023-10-31',23,1,4,42,6,'rus'),(24,'Бесконечные циклы и ограничения','2023-10-31',24,1,5,43,7,'rus'),(25,'Вложенные циклы','2023-10-31',25,1,5,44,7,'rus'),(26,'Прерывание циклов','2023-10-31',26,1,5,45,7,'rus'),(27,'Цикл dowhile','2023-10-31',27,1,5,46,7,'rus'),(28,'Цикл for','2023-10-31',28,1,5,47,7,'rus'),(29,'Цикл while','2023-10-31',29,1,5,48,7,'rus'),(30,'For-each','2023-10-31',30,1,5,49,7,'rus'),(31,'Override','2023-10-31',31,1,5,50,7,'rus'),(32,'Введение в коллекции','2023-10-31',32,1,6,51,8,'rus'),(33,'Введение в массивы','2023-10-31',33,1,6,52,8,'rus'),(34,'Введение в View Binding','2023-10-31',34,1,6,53,8,'rus'),(35,'Использование множеств (Set)','2023-10-31',35,1,6,54,8,'rus'),(36,'Использование отображений (Map)','2023-10-31',36,1,6,55,8,'rus'),(37,'Использование списков (List)','2023-10-31',37,1,6,56,8,'rus'),(38,'Многомерные массивы','2023-10-31',38,1,6,57,8,'rus'),(39,'Операции над массивами','2023-10-31',39,1,6,58,8,'rus'),(40,'Отличия между массивами и коллекциями','2023-10-31',40,1,6,59,8,'rus'),(41,'Функции высшего порядка','2023-10-31',41,1,6,60,8,'rus'),(42,'Введение в жизненный цикл Activity','2023-10-31',42,1,7,61,9,'rus'),(43,'Работа с намерениями и переходами между действиями','2023-10-31',43,1,7,62,9,'rus'),(44,'Управление жизненным циклом Activity','2023-10-31',44,1,7,63,9,'rus'),(45,'Debug','2023-10-31',45,1,7,64,9,'rus'),(46,'Введение(ООП)','2023-10-31',46,1,8,65,10,'rus'),(47,'Инкапсуляция','2023-10-31',47,1,8,66,10,'rus'),(48,'Наследование, Абстрактные классы и Интерфейсы','2023-10-31',48,1,8,67,10,'rus'),(49,'Перегрузка методов','2023-10-31',49,1,8,68,10,'rus'),(50,'Полиморфизм','2023-10-31',50,1,8,69,10,'rus'),(51,'Фрагменты','2023-10-31',51,1,8,70,10,'rus'),(52,'MVP','2023-10-31',52,3,15,71,19,'rus'),(53,'MVVM','2023-10-31',53,3,15,72,19,'rus'),(54,'MVI','2023-10-31',54,3,15,73,19,'rus'),(55,'LiveData','2023-10-31',55,3,15,74,19,'rus'),(56,'Flow','2023-10-31',56,3,15,75,19,'rus'),(57,'Сравнение Flow и LiveData','2023-10-31',57,3,15,76,19,'rus'),(58,'Сравнение MVP, MVVM и MVI','2023-10-31',58,3,15,77,19,'rus'),(59,'Clean Architecture','2023-10-31',59,3,15,78,19,'rus'),(60,'Асинхронное программирование','2023-10-31',60,3,16,79,20,'rus'),(61,'Асинхронные паттерны','2023-10-31',61,3,16,80,20,'rus'),(62,'Антипаттерны','2023-10-31',62,3,16,81,20,'rus'),(63,'Основы Многопоточности','2023-10-31',63,3,16,82,20,'rus'),(64,'Многозадачность (Multitasking)','2023-10-31',64,3,16,83,20,'rus'),(65,'Пулы потоков и Задачи','2023-10-31',65,3,16,84,20,'rus'),(66,'Параллелизм и Конкурентность','2023-10-31',66,3,16,85,20,'rus'),(67,'Использование Coroutines в ViewModel','2023-10-31',67,3,16,86,20,'rus'),(68,'Введение в Koin','2023-10-31',68,3,17,87,21,'rus'),(69,'Фабрики и Ленивая Инициализация','2023-10-31',69,3,17,88,21,'rus'),(70,'Scopes и Жизненные Циклы','2023-10-31',70,3,17,89,21,'rus'),(71,'Дополнительные Возможности Koin','2023-10-31',71,3,17,90,21,'rus'),(72,'Тестирование с помощью Koin','2023-10-31',72,3,17,91,21,'rus'),(73,'Модульное Тестирование','2023-10-31',73,3,17,92,21,'rus'),(74,'Обработка Ошибок и Исключений в Koin','2023-10-31',74,3,17,93,21,'rus'),(75,'Введение в Dagger Hilt','2023-10-31',75,3,18,94,22,'rus'),(76,'Основы аннотаций Dagger Hilt','2023-10-31',76,3,18,95,22,'rus'),(77,'Жизненный цикл и области видимости в Dagger Hilt','2023-10-31',77,3,18,96,22,'rus'),(78,'Использование ViewModel с Dagger Hilt','2023-10-31',78,3,18,97,22,'rus'),(79,'Дополнительные функции Dagger Hilt','2023-10-31',79,3,18,98,22,'rus'),(80,'Тестирование с помощью Dagger Hilt','2023-10-31',80,3,18,99,22,'rus'),(81,'Введение в Тестирование','2023-10-31',81,3,19,100,23,'rus'),(82,'Unit-Тестирование','2023-10-31',82,3,19,101,23,'rus'),(83,'Интеграционное Тестирование','2023-10-31',83,3,19,102,23,'rus'),(84,'Тестирование Kotlin Coroutines','2023-10-31',84,3,19,103,23,'rus'),(85,'Тестирование Исключений','2023-10-31',85,3,19,104,23,'rus'),(86,'Тестирование REST API','2023-10-31',86,3,19,105,23,'rus'),(87,'Mocking и Stubbing в Тестировании','2023-10-31',87,3,19,106,23,'rus'),(88,'Ресурсы android studio','2023-10-31',88,1,2,107,4,'rus'),(89,'Что такое контекст в Android','2023-10-31',89,2,9,108,12,'rus'),(90,'Использование контекста для доступа к ресурсам','2023-10-31',90,2,9,109,12,'rus'),(91,'Использование контекста для запуска новой активити','2023-10-31',91,2,9,110,12,'rus'),(92,'Использование контекста для создания диалоговых окон','2023-10-31',92,2,9,111,12,'rus'),(93,'Обращение к системным службам через контекст','2023-10-31',93,2,9,112,12,'rus'),(94,'Осторожно с контекстом','2023-10-31',94,2,9,113,12,'rus'),(95,'ListAdapter','2023-10-31',95,2,10,114,13,'rus'),(96,'RecyclerView и создание адаптеров','2023-10-31',96,2,10,115,13,'rus'),(97,'DiffUtil в RecyclerView','2023-10-31',97,2,10,116,13,'rus'),(98,'Swipe-to-Refresh','2023-10-31',98,2,10,117,13,'rus'),(99,'Выбор множества элементов в RecyclerView','2023-10-31',99,2,10,118,13,'rus'),(100,'Обработка пустых списков и ошибок в RecyclerView','2023-10-31',100,2,10,119,13,'rus'),(101,'Навигация','2023-10-31',101,2,11,120,14,'rus'),(102,'Bottom Navigation','2023-10-31',102,2,11,121,14,'rus'),(103,'BottomSheetDialogFragment','2023-10-31',103,2,11,122,14,'rus'),(104,'Navigation Component','2023-10-31',104,2,11,123,14,'rus'),(105,'Navigation Drawer','2023-10-31',105,2,11,124,14,'rus'),(106,'Custom Transition Animations','2023-10-31',106,2,11,125,14,'rus'),(107,'Safe Args','2023-10-31',107,2,11,126,14,'rus'),(108,'Введение в Retrofit','2023-10-31',108,2,12,127,15,'rus'),(109,'Конвертация JSON в объекты','2023-10-31',109,2,12,128,15,'rus'),(110,'Отправка данных в теле запроса ','2023-10-31',110,2,12,129,15,'rus'),(111,'Обработка ответов и ошибок','2023-10-31',111,2,12,130,15,'rus'),(112,'Использование Kotlin Coroutines с Retrofit','2023-10-31',112,2,12,131,15,'rus'),(113,'Загрузка файлов','2023-10-31',113,2,12,132,15,'rus'),(114,'Использование Query-параметров и путей','2023-10-31',114,2,12,133,15,'rus'),(115,'Кэширование и работа с кэшем','2023-10-31',115,2,12,134,15,'rus'),(116,'Тестирование с Retrofit','2023-10-31',116,2,12,135,15,'rus'),(117,'Интерцепторы и авторизация в Retrofit','2023-10-31',117,2,12,136,15,'rus'),(118,'Работа с галереей устройства','2023-10-31',118,2,13,137,16,'rus'),(119,'Работа с камерой устройства','2023-10-31',119,2,13,138,16,'rus'),(120,'Работа с форматами изображений','2023-10-31',120,2,13,139,16,'rus'),(121,'Загрузка фотографий из сети','2023-10-31',121,2,13,140,16,'rus'),(122,'Glide','2023-10-31',122,2,13,141,16,'rus'),(123,'Picasso','2023-10-31',123,2,13,142,16,'rus'),(124,'Coil','2023-10-31',124,2,13,143,16,'rus'),(125,'Сравнение  Glide, Picasso и Coil','2023-10-31',125,2,13,144,16,'rus'),(126,'Что такое утечка памяти','2023-10-31',126,2,14,145,17,'rus'),(127,'Понимание сборки мусора','2023-10-31',127,2,14,146,17,'rus'),(128,'Популярные источники утечек памяти','2023-10-31',128,2,14,147,17,'rus'),(129,'Примеры утечек и их решения','2023-10-31',129,2,14,148,17,'rus'),(130,'Инструменты для обнаружения утечек памяти','2023-10-31',130,2,14,149,17,'rus'),(131,'Принципы устранения утечек памяти','2023-10-31',131,2,14,150,17,'rus'),(132,'Работа с изображениями и памятью','2023-10-31',132,2,14,151,17,'rus'),(133,'Оптимизация и профилирование','2023-10-31',133,2,14,152,17,'rus');
/*!40000 ALTER TABLE `lesson` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-11-29 17:15:49
